package com.Study7;

/**
 * ClassName Study7
 *
 * @Date2025/2/281:16
 * @Create bysunlight
 */
public class Study7 {

    /**
     * 静态： static：
     *      static表示静态，是Java中的一个修饰符，可以修饰成员方法，成员变量
     *
     *   静态变量：
     *      特点：
     *          被该类所有对象共享
     *          不属于对象，属于类
     *          随着类的加载而加载，优先于对象存在
     *      调用方式：
     *          1.类名调用
     *          2.对象名调用
     *
     *    静态方法：
     *       特点：
     *          多用在测试类和工具类中
     *       调用方式：
     *          1.类名调用
     *          2.对象名调用
     *
     *
     *     注意事项：
     *          1.静态方法只能访问静态变量和静态方法
     *          2.非静态方法可以访问所有
     *          3.静态方法中没有this关键字
     */




}
