package com.sunlight;

/**
 * ClassName Study07
 *
 * @Date2025/2/192:00
 * @Create bysunlight
 */
public class Study07 {


    /**
     *  原码、反码、补码：
     *      原码：十进制数据的二进制标识形式，最左边是符号位，0为正，1为负
     *      反码：正数的补码反码是其本身，负数的反码是符号位保持不变，其余位取反  （是为了解决原码不能计算负数的问题而出现的）
     *      补码：正数的补码是其本身，负数的补码是在其反码的基础上+1         （是为了解决负数计算时跨0的问题而出现的）
     *
     *
     *  注：计算机在存储和计算都是以补码的形式进行的
     */


    /**
     *
     * 运算符：
     *      <<：     左移，         向左移动，低位补0
     *      >>:      右移，         向右移动，高位补0或1
     *      >>>:     无符号右移，    向右移动，高位补0
     *      &：      逻辑与，       0为false，1为true
     *      |：      逻辑或，       0为false，1为true
     *
     */

}
