package com.sunlight;

/**
 * ClassName Study02
 *
 * @Date2025/2/1823:17
 * @Create bysunlight
 */
public class Study02 {

    //单行注释：  //注释信息
    //多行注释: /*注释信息*/
    //文档注释：
    /**
     * 注释信息
     */


    /**
     * 字面量：
     *      整数类型    不带小数点的数字
     *      小数类型    带小数点的数字
     *      字符串类型   用双引号括起来的内容
     *      字符类型    用单引号括起来，内容只有一个
     *      布尔类型    布尔值，表示真假            只有两个值：true、
     *      空类型     一个特殊的值，空值。          值是null
     *      制表符： \t
     */


    /**
     * 变量的注意事项：
     *      1.只能存一个值
     *      2.变量名不允许重复定义
     *      3.一条语句可以定义多个变量
     *      4.变量在使用之前一定要进行赋值
     */
}
